package homework;

public class L7MainHW {

    /*
    Есть компания в которой работают сотрудники(Имя, Фамилия, Возраст, ЗП).
    Глобально сторудники делятся на два типа: менеджеры и исполнители.
    К менеджерам относятся: Директора (String название дирекции), начальники отделов  (String  название отдела).
    Менеджеры: в отличие от всех остальных имеют дополнительную прибавку к ЗП в размере 5%.
    У директоров есть дополнительная ежемесячная премия в размере 1500 уе, у начальников отделов ежемесячная премия составляет 750 уе.
    К исполнителям относятся Программисты (Srting язык) и  Тестировщики(Srting проект).
    У Программистовесть ежемесячная прибавка к ЗП 300 уе, у тестировщиков её нет совсем.

    Создайте иерархию классов для возможности оптимально реализовать в компании следующие методы :
      - найти сторудника с максимальной  ЗП
        - найти сторудника с минимальной ЗП
        - найти среднюю ЗП среди сотрудников
        - найти среднюю ЗП у менеджеров
        -найти среднюю ЗП у исполнителей
            У Директоров, НачОтделов, Программистов, Тестировщиков реализовать следующие конструкторы:
            - все значения полей передаются через параметры;
        - все значения генерируются случайно:
        - Имя из множества: Иван, Петр;
        - Фамилия из множества Николаенко, Сидоров;
        - возраст от 18 до 65; ЗП от 1 500 до 45 000;
        - Название дирекции - "Маркетинг", "Проектная";
        - Названия отделов "Первый-отдел", "Второй-отдел", "Третий-отдел"; Язык программирования - "Java", "C#", "Python"; - Названия проектов - "UBS", "Pentagon", "NASA".
    Реализуйте метод профайл который выдает строку с полногй информацией о сотруднике : Менеждер он или осполнитель,  детальная информация - (Дирекция или отдел или язык программирования или проект), Фамилия, Имя, Возраст, ЗП.
*/

}
